src/InformationRegisters/УП_ЦеныИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УП_ЦеныИнструментов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УП_БиржевыеИнструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/УП_Индексы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УП_Индексы</Name>
			<Comment>Биржевые индексы с составом входящих активов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УП_ТипыИндексов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УП_БиржевыеИнструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/УП_Портфели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УП_Портфели</Name>
			<Comment>Произвольный набор активов пользователя</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УП_БиржевыеИнструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/УП_ЦеныИнструментов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьЦены(МассивТикеров = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(МассивТикеров) Тогда
		МассивТикеров = _ВсеТикеры();
	КонецЕсли;
	
	Результат = _ТаблицаЦен(МассивТикеров);
	
	Если Результат.ПроизошлаОшибка Тогда
		ВызватьИсключение Результат.ТекстОшибки;
	КонецЕсли;
	
	ТаблицаЦен = Результат.Данные;
	Период = ТекущаяДатаСеанса();
	
	НачатьТранзакцию();
	Попытка
		
		НаборЗаписей = РегистрыСведений.УП_ЦеныИнструментов.СоздатьНаборЗаписей();
		
		Для Каждого ЦенаИнструмента Из ТаблицаЦен Цикл
			
			Инструмент = Справочники.УП_БиржевыеИнструменты.НайтиПоКоду(ЦенаИнструмента.Тикер);
			
			Если Не ЗначениеЗаполнено(Инструмент) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = Период;
			НоваяЗапись.Инструмент = Инструмент;
			НоваяЗапись.Цена = ЦенаИнструмента.Цена;

		КонецЦикла;
		
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область _Описания

Функция _ДлинаТикера()
    Возврат 10;
КонецФункции

Функция _ДлинаЦены()
    Возврат 10;
КонецФункции

Функция _ТочностьЦены()
	Возврат 2;
КонецФункции

#КонецОбласти

Функция _ВсеТикеры()

	ЗапросТикеров = Новый Запрос;
	ЗапросТикеров.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УП_ИндексыСостав.Инструмент КАК Ссылка
	|ПОМЕСТИТЬ врИнструменты
	|ИЗ
	|	Справочник.УП_Индексы.Состав КАК УП_ИндексыСостав
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	УП_ПортфелиСостав.Инструмент
	|ИЗ
	|	Справочник.УП_Портфели.Состав КАК УП_ПортфелиСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БИ.Код КАК Тикер
	|ИЗ
	|	врИнструменты КАК врИнструменты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УП_БиржевыеИнструменты КАК БИ
	|		ПО (БИ.Ссылка = врИнструменты.Ссылка)";
	
	Тикеры = ЗапросТикеров.Выполнить().Выгрузить().ВыгрузитьКолонку("Тикер");
	
	Возврат Тикеры;
	
КонецФункции

Функция _ТаблицаЦен(МассивТикеров)
	
	Результат = УП_ОбщегоНазначения.ОписаниеРезультата();

	ТаблицаЦен = Новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Тикер", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(_ДлинаТикера())));
	ТаблицаЦен.Колонки.Добавить("Цена",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(_ДлинаЦены(), _ТочностьЦены())));
	
	// Получаем данные по всем тикерам сразу
	// Здесь важно, что _ДанныеИнструментов уже фильтрует по TQBR
	КлиентАпи = Обработки.УП_КлиентМосбиржи.Создать().Инит();
	
	ДанныеИнструментовРезультат = КлиентАпи.ДанныеИнструментов(МассивТикеров);

	Если ДанныеИнструментовРезультат.ПроизошлаОшибка Тогда
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Ошибка при получении данных по инструментам: " + ДанныеИнструментовРезультат.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;

	ДанныеВсехАкции = ДанныеИнструментовРезультат.Данные;

	Если ДанныеВсехАкции = Неопределено 
		Или ДанныеВсехАкции.Получить("marketdata") = Неопределено
		Или ДанныеВсехАкции.Получить("marketdata").Получить("columns") = Неопределено
		Или ДанныеВсехАкции.Получить("marketdata").Получить("data") = Неопределено Тогда
		Сообщить("Отсутствуют необходимые данные 'marketdata' или 'columns'/'data' в ответе.");
		Возврат Результат;
	КонецЕсли;

	Колонки = ДанныеВсехАкции.Получить("marketdata").Получить("columns");
	Данные  = ДанныеВсехАкции.Получить("marketdata").Получить("data");

	Если Колонки.Количество() = 0 Тогда
		Сообщить("Отсутствуют колонки данных 'marketdata'.");
		Возврат Результат;
	КонецЕсли;
	
	Если Данные.Количество() = 0 Тогда
		Сообщить("Отсутствуют данные 'marketdata.data'.");
		Возврат Результат;
	КонецЕсли;

	ИндексТикер  = -1;
	ИндексЦенаLast = -1;
	ИндексЦенаMarket = -1;

	// Определяем индексы колонок
	Для й = 0 По Колонки.Количество() - 1 Цикл
		Если Колонки[й] = "SECID" Тогда
			ИндексТикер = й;
		ИначеЕсли Колонки[й] = "LAST" Тогда // Нас интересует только LAST
			ИндексЦенаLast = й;
		ИначеЕсли Колонки[й] = "MARKETPRICE" Тогда
			ИндексЦенаMarket = й;
		КонецЕсли;
	КонецЦикла;

	Если ИндексТикер = -1 Тогда
		Сообщить("В полученных данных отсутствует колонка 'SECID'.");
		Возврат Результат;
	КонецЕсли;
	
	// Оставляем только проверку на 'LAST'
	Если ИндексЦенаLast = -1 Тогда
		Сообщить("В полученных данных отсутствует колонка 'LAST' для получения последней цены.");
		Возврат Результат;
	КонецЕсли;

	Для Каждого СтрокаДанных Из Данные Цикл
		Если СтрокаДанных.Количество() > ИндексТикер Тогда
			НоваяСтрока = ТаблицаЦен.Добавить();
			НоваяСтрока.Тикер = СтрокаДанных[ИндексТикер];

			Цена = 0;
            // Проверяем наличие LAST и то, что значение не Неопределено
			Если СтрокаДанных.Количество() > ИндексЦенаLast И СтрокаДанных[ИндексЦенаLast] <> Неопределено Тогда
				Цена = СтрокаДанных[ИндексЦенаLast];
			ИначеЕсли СтрокаДанных.Количество() > ИндексЦенаMarket И СтрокаДанных[ИндексЦенаMarket] <> Неопределено Тогда
				Цена = СтрокаДанных[ИндексЦенаMarket];
			КонецЕсли;
			
			НоваяСтрока.Цена = Цена;
		КонецЕсли;
	КонецЦикла;

	Результат.Данные = ТаблицаЦен;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
